app/views/projects/_form.html.erb

SELECT  1 AS one FROM "requirements" WHERE "requirements"."project_id" = ? LIMIT 1  [["project_id", 1]]
---

  <% if @project.requirements.any? %>