app/views/projects/show.html.erb

      </tr>
  <% if @project.requirements.any? %>
---
SELECT  1 AS one FROM "requirements" WHERE "requirements"."project_id" = ? LIMIT 1  [["project_id", 12]]
SELECT "requirements".* FROM "requirements" WHERE "requirements"."project_id" = ?  [["project_id", 12]]