app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"