app/controllers/in_procures_controller.rb

  def index
    @in_procures = InProcure.all
---
SELECT "in_procures".* FROM "in_procures"