app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("name", "serial", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "進料單"], ["serial", "T01"], ["created_at", "2015-11-22 08:15:01.157659"], ["updated_at", "2015-11-22 08:15:01.157659"]]

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "serial" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["serial", "T02"], ["updated_at", "2015-11-25 08:25:31.912650"], ["id", 2]]