app/controllers/materials_controller.rb

  def index
    @materials = Material.page(params[:page]).per(10)
---
SELECT  "materials".* FROM "materials" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "materials"

  def create
    @material = Material.new(material_params)

    respond_to do |format|
      if @material.save
---
INSERT INTO "materials" ("cat1", "cat2", "cat3", "cat4", "num_sup", "serial", "name", "spec", "unit", "supplier", "replenish_policy", "replenish_period", "description", "weight_unit", "memo", "num_material_drawing", "min_stock", "pick_unit", "lead_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_material
      @material = Material.find(params[:id])
---
SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT 1  [["id", 1]]