app/controllers/procures_controller.rb

SELECT  "procures".* FROM "procures" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "procures"
---
  def index
    @procures = Procure.page(params[:page]).per(10)

UPDATE "procures" SET "note" = ?, "date" = ?, "updated_at" = ? WHERE "procures"."id" = ?  [["note", ""], ["date", "2015-12-07"], ["updated_at", "2015-12-07 03:19:14.534012"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @procure.update(procure_params)

SELECT  "procures".* FROM "procures" WHERE "procures"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_procure
      @procure = Procure.find(params[:id])