app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "projects"
---
  def index
    @projects = Project.page(params[:page]).per(10)

INSERT INTO "projects" ("name", "serial", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Project 1 "], ["serial", "001"], ["status", "保固中"], ["created_at", "2015-11-25 06:26:57.568792"], ["updated_at", "2015-11-25 06:26:57.568792"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "serial" = ?, "status" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["serial", ""], ["status", "專案進行中"], ["updated_at", "2015-12-07 03:22:15.232292"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)