app/controllers/slots_controller.rb

  def index
    @slots = Slot.page(params[:page]).per(10)
---
SELECT  "slots".* FROM "slots" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "slots"

  def create
    @slot = Slot.new(slot_params)

    respond_to do |format|
      if @slot.save
---
INSERT INTO "slots" ("name", "serial", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "庫位一"], ["serial", "s001"], ["position", "林口"], ["created_at", "2015-11-25 06:41:38.547468"], ["updated_at", "2015-11-25 06:41:38.547468"]]

    def set_slot
      @slot = Slot.find(params[:id])
---
SELECT  "slots".* FROM "slots" WHERE "slots"."id" = ? LIMIT 1  [["id", 1]]