app/views/procures/_form.html.erb

SELECT  1 AS one FROM "projects" INNER JOIN "buys" ON "projects"."id" = "buys"."project_id" WHERE "buys"."procure_id" = ? LIMIT 1  [["procure_id", 1]]
---

  <% if @procure.projects.any? %>