app/views/procures/show.html.erb

SELECT  1 AS one FROM "projects" INNER JOIN "buys" ON "projects"."id" = "buys"."project_id" WHERE "buys"."procure_id" = ? LIMIT 1  [["procure_id", 1]]
SELECT "projects".* FROM "projects" INNER JOIN "buys" ON "projects"."id" = "buys"."project_id" WHERE "buys"."procure_id" = ?  [["procure_id", 1]]
---
  </thead>
  <% if @procure.projects.any? %>